"""
029. 找出最大質數
輸入一個數 x ，根據以下規則得到 k ，並找出 2 到 k 之間最大的質數。
處理輸入請使用有限狀態機，不要使用陣列
規則:
1. 若 x 為正整數，且 2 <= x <= 1000，則 k = x
2. 若 x = 0 或 x = 1，則 k = 1000
3. 若 x 為負整數，則 k = x * -11
4. 若 x 為正小數，則 k = 小數點前面的數
5. 若 x 為負小數，則 k = 小數點後面的數
規則範例:
1. x = 50， k = 50
2. x = 0， k = 1000
3. x = -90， k = 990
4. x = 66.22， k = 66
5. x = -33.44， k = 44
-----------------------------------------
輸入說明：
輸入一個數字。
輸出說明：
根據規則找出 k ，輸出 2 到 k 之間最大的質數。
不合法的輸入則輸出Error!
-----------------------------------------
輸入範例:
50
輸出範例:
47
-----------------------------------------
輸入範例:
0
輸出範例:
997
-----------------------------------------
輸入範例:
-90
輸出範例:
983
-----------------------------------------
輸入範例:
66.22
輸出範例:
61
-----------------------------------------
輸入範例:
-33.44
輸出範例:
43
-----------------------------------------
輸入範例:
1001
輸出範例:
Error!
"""

from math import ceil, floor
def main():
    num = float(input())
    
    #若 x 為負整數，則 k = x * -11
    if(num<0 and floor(num)==ceil(num)): 
        num = int(num) * -11
        print('%d' %search(num))
    
    #若 x 為負小數，則 k = 小數點後面的數
    elif(num<0): 
        num, fraction = map(int, str(num).split('.'))
        print('%d' %search(fraction))
        
    #若 x = 0 或 x = 1，則 k = 1000
    elif((int(num)==0 or int(num)==1) and floor(num)==ceil(num)): 
        print('%d' %search(1000))
        
    #若 x 為正整數，且 2 <= x <= 1000，則 k = x && 若 x 為正小數，則 k = 小數點前面的數 (int取整數 無條件捨去)
    elif(2<=int(num)<=1000): 
        print('%d' %search(int(num)))
        
    else:
        print('Error!')

def search(num): #找最大質數
    #由大到小 num~1
    for i in range(num, 0, -1): 
        for j in range(2, num//2+1):
            #整除就不是質數
            if(i%j==0): 
                i = 0
                break
        if(i!=0):
            return i
main()